Repository: oqulabs-diploma/back
Catalog: locale/*/LC_MESSAGES/django.po
Languages: kk, ru

source: Username:
kk: Пайдаланушы аты:
ru: Имя пользователя:

source: Your courses
kk: Сіздің курстарыңыз
ru: Ваши курсы

source: Work
kk: Жұмыс
ru: Работа

source: No courses found, consider creating one
kk: Курстар табылмады, жасауды қарастырыңыз
ru: Курсы не найдены, рассмотрите возможность создания курса

source: Enroll to a course
kk: Курсқа жазылу
ru: Записаться на курс

source: Total odo:
kk: Жалпы одо:
ru: Всего одо:

source: Ban:
kk: Бұғаттау:
ru: Бан:

source: Tasks
kk: Тапсырма:
ru: Задание:

source: Course:
kk: Курс:
ru: Курс:

source: Task
kk: Тапсырма
ru: Задание

source: Time
kk: Уақыт
ru: Время

source: Progress
kk: Прогресс
ru: Прогресс

source: Inactive
kk: Белсенді емес
ru: Неактивно

source: No tasks found
kk: Тапсырмалар табылмады
ru: Задания не найдены

source: Back
kk: Артқа
ru: Назад

source: Log out
kk: Шығу
ru: Выйти

source: Task Monitoring
kk: Тапсырманы бақылау
ru: Мониторинг задания

source: INTERNET ERROR!
kk: ИНТЕРНЕТ ҚАТЕСІ!
ru: ОШИБКА ИНТЕРНЕТА!

source: Task:
kk: Тапсырма:
ru: Задание:

source: Student:
kk: Студент:
ru: Студент:

source: This task:
kk: Осы тапсырма:
ru: Текущее задание:

source: Total:
kk: Жалпы:
ru: Всего:

source: Share Screen
kk: Экранды бөлісу
ru: Поделиться экраном

source: Share Camera
kk: Камераны бөлісу
ru: Поделиться камерой

source: Stop Sharing
kk: Бөлісуді тоқтату
ru: Остановить трансляцию

source: Instructions
kk: Нұсқаулар
ru: Инструкции

source: You have to finish this task before the deadline:
kk: Сіз бұл тапсырманы мерзімінен бұрын аяқтауыңыз керек:
ru: Вы должны завершить это задание до крайнего срока:

source: You won't be able to submit your work after the deadline.
kk: Мерзімнен кейін жұмысыңызды тапсыра алмайсыз.
ru: Вы не сможете отправить свою работу после истечения срока.

source: Send Images
kk: Суреттерді жіберу
ru: Отправить изображения

source: Kazakh
kk: Қазақша
ru: Казахский

source: English
kk: Ағылшынша
ru: Английский

source: Russian
kk: Орысша
ru: Русский

source: Enroll to course
kk: Курсқа тіркелу
ru: Записаться на курс

source: Enrollment Code
kk: Курсқа тіркелу құпия сөзі
ru: Записаться на курс

source: Please make sure you are at the right server. Currently, you are at
kk: Дұрыс серверде екеніңізге көз жеткізіңіз. Қазіргі уақытта сіз
ru: Пожалуйста, убедитесь, что вы находитесь на правильном сервере. В данный момент вы находитесь на

source: Enroll
kk: Тіркелу
ru: Записаться

source: Ask your teacher for the enrollment code.
kk: Тіркелу құпия сөзін мұғаліміңізден сұраңыз.
ru: Спросите у вашего учителя код зачисления.

source: Check your images before sending
kk: Суреттеріңізді жібермес бұрын тексеріңіз
ru: Проверьте изображения перед отправкой

source: Instructions for Working with Screenshots
kk: Скриншоттармен жұмыс істеу бойынша нұсқаулық
ru: Инструкции по работе со скриншотами

source: Viewing Screenshots:
kk: Скриншоттарды қарау:
ru: Просмотр скриншотов:

source: Use the player located on the left side of the screen to carefully review all the screenshots of your work.
kk: Жұмысыңыздың барлық скриншоттарын мұқият қарау үшін экранның сол жағында орналасқан ойнатқышты пайдаланыңыз.
ru: Используйте проигрыватель, расположенный слева на экране, чтобы внимательно просмотреть все скриншоты вашей работы.

source: Selecting Relevant Images:
kk: Қажетті суреттерді таңдау:
ru: Выбор нужных изображений:

source: Keep only those screenshots that accurately reflect the completed work.
kk: Тек орындалған жұмысты дәл көрсететін скриншоттарды қалдырыңыз.
ru: Оставьте только те скриншоты, которые точно отражают выполненную работу.

source: Deleting Unnecessary Screenshots:
kk: Қажетсіз скриншоттарды жою:
ru: Удаление ненужных скриншотов:

source: Remove unwanted images using the Delete button.
kk: "Жою" батырмасын пайдаланып қажетсіз суреттерді өшіріңіз.
ru: Удалите ненужные изображения, используя кнопку "Удалить".

source: Attaching the Work File:
kk: Жұмыс файлын тіркеу:
ru: Прикрепление файла с работой:

source: If required, attach the file containing your completed work using the provided form.
kk: Қажет болған жағдайда, дайын жұмысыңыз бар файлды берілген форма арқылы тіркеңіз.
ru: Если необходимо, прикрепите файл с выполненной работой, используя предоставленную форму.

source: Sending the Completed Work:
kk: Дайын жұмысты жіберу:
ru: Отправка выполненной работы:

source: After making your selections, be sure to send your work by clicking the Share Work button.
kk: Таңдауыңызды жасағаннан кейін, "Жұмысты жіберу" батырмасын басу арқылы жұмысыңызды жіберуді ұмытпаңыз.
ru: После выбора необходимых файлов, обязательно отправьте свою работу, нажав на кнопку "Отправить работу".

source: Upload File
kk: Файлды жүктеу
ru: Загрузить файл

source: You can't attach files right now, deadline is over
kk: Қазір файлдарды тіркеу мүмкін емес, соңғы мерзім өтті
ru: Вы не можете прикреплять файлы сейчас, срок истёк

source: Uploading file
kk: Файл жүктелуде
ru: Загрузка файла

source: Download:
kk: Жүктеу:
ru: Скачать:

source: Delete
kk: Жою
ru: Удалить

source: Continue working
kk: Жұмысты жалғастыру
ru: Продолжить работу

source: Share work
kk: Экранмен бөлісу
ru: Поделиться экраном
